Masmiseim36/nxpSDK/devices/MIMXRT1186/mcuxpresso/startup_mimxrt1186_cm7.c
extern void (* const g_pfnVectors[])(void);
extern void * __Vectors __attribute__ ((alias ("g_pfnVectors")));

__attribute__ ((used, section(".isr_vector")))
void (* const g_pfnVectors[])(void) = {
    // Core Level - CM7
    &_vStackTop,                       // The initial stack pointer
    ResetISR,                          // The reset handler
    NMI_Handler,                       // NMI Handler
    HardFault_Handler,                 // Hard Fault Handler
    MemManage_Handler,                 // MPU Fault Handler
    BusFault_Handler,                  // Bus Fault Handler
    UsageFault_Handler,                // Usage Fault Handler
    0,                                 // Reserved
    0,                                 // Reserved
    0,                                 // Reserved
    0,                                 // Reserved
    SVC_Handler,                       // SVCall Handler
    DebugMon_Handler,                  // Debug Monitor Handler
    0,                                 // Reserved
    PendSV_Handler,                    // PendSV Handler
    SysTick_Handler,                   // SysTick Handler

    // Chip Level - MIMXRT1186_cm7
    TMR1_IRQHandler,                          // 16 : TMR1 interrupt
    DAP_IRQHandler,                          // 17 : DAP interrupt
    M7_CTI_TRIGGER_OUTPUT_IRQHandler,                // 18 : CTI trigger outputs from CM7
    M33_CTI_TRIGGER_OUTPUT_IRQHandler,               // 19 : CTI trigger outputs from CM33
    TMR5_IRQHandler,                          // 20 : TMR5 interrupt
    TMR6_IRQHandler,                          // 21 : TMR6 interrupt
    TMR7_IRQHandler,                          // 22 : TMR7 interrupt
    TMR8_IRQHandler,                          // 23 : TMR8 interrupt
    CAN1_IRQHandler,                          // 24 : CAN1 interrupt
    CAN1_ERROR_IRQHandler,                          // 25 : CAN1 error interrupt
    GPIO1_0_IRQHandler,                          // 26 : GPIO1 interrupt 0
    GPIO1_1_IRQHandler,                          // 27 : GPIO1 interrupt 1
    I3C1_IRQHandler,                          // 28 : I3C1 interrupt
    LPI2C1_IRQHandler,                          // 29 : LPI2C1 interrupt
    LPI2C2_IRQHandler,                          // 30 : LPI2C2 interrupt
    LPIT1_IRQHandler,                          // 31 : LPIT1 interrupt
    LPSPI1_IRQHandler,                          // 32 : LPSPI1 interrupt
    LPSPI2_IRQHandler,                          // 33 : LPSPI2 interrupt
    LPTMR1_IRQHandler,                          // 34 : LPTMR1 interrupt
    LPUART1_IRQHandler,                          // 35 : LPUART1 interrupt
    LPUART2_IRQHandler,                          // 36 : LPUART2 interrupt
    MU1_IRQHandler,                          // 37 : MU1 interrupt
    MU2_IRQHandler,                          // 38 : MU2 interrupt
    PWM1_FAULT_IRQHandler,                          // 39 : PWM1 fault or reload error interrupt
    PWM1_0_IRQHandler,                          // 40 : PWM1 capture 0, compare 0, or reload 0 interrupt
    PWM1_1_IRQHandler,                          // 41 : PWM1 capture 1, compare 1, or reload 1 interrupt
    PWM1_2_IRQHandler,                          // 42 : PWM1 capture 2, compare 2, or reload 2 interrupt
    PWM1_3_IRQHandler,                          // 43 : PWM1 capture 3, compare 3, or reload 3 interrupt
    EDGELOCK_TRUST_MUA_RX_FULL_IRQHandler,           // 44 : Edgelock Trust MUA RX full interrupt
    EDGELOCK_TRUST_MUA_TX_EMPTY_IRQHandler,          // 45 : Edgelock Trust MUA TX empty interrupt
    EDGELOCK_APPS_CORE_MUA_RX_FULL_IRQHandler,       // 46 : Edgelock Apps Core MUA RX full interrupt
    EDGELOCK_APPS_CORE_MUA_TX_EMPTY_IRQHandler,      // 47 : Edgelock Apps Core MUA TX empty interrupt
    EDGELOCK_REALTIME_CORE_MUA_RX_FULL_IRQHandler,   // 48 : Edgelock Realtime Core MUA RX full interrupt
    EDGELOCK_REALTIME_CORE_MUA_TX_EMPTY_IRQHandler,  // 49 : Edgelock Realtime Core MUA TX empty interrupt
    EDGELOCK_SECURE_IRQHandler,                      // 50 : Edgelock secure interrupt
    EDGELOCK_NONSECURE_IRQHandler,                   // 51 : Edgelock non-secure interrupt
    TPM1_IRQHandler,                          // 52 : TPM1 interrupt
    TPM2_IRQHandler,                          // 53 : TPM2 interrupt
    RTWDOG1_IRQHandler,                          // 54 : RTWDOG1 interrupt
    RTWDOG2_IRQHandler,                          // 55 : RTWDOG2 interrupt
    TRDC_MGR_AON_IRQHandler,                         // 56 : AONMIX TRDC transfer error interrupt
    PDM_HWVAD_EVENT_IRQHandler,                      // 57 : HWVAD event interrupt
    PDM_HWVAD_ERROR_IRQHandler,                      // 58 : HWVAD error interrupt
    PDM_EVENT_IRQHandler,                          // 59 : PDM event interrupt
    PDM_ERROR_IRQHandler,                          // 60 : PDM error interrupt
    SAI1_IRQHandler,                          // 61 : SAI interrupt
    CM33_PS_IRQHandler,                          // 62 : M33 PS Tag/Data Parity Error
    CM33_TCM_ECC_IRQHandler,                         // 63 : M33 TCM ECC interrupt
    CM33_TCM_ERROR_IRQHandler,                       // 64 : M33 TCM Error interrupt
    CM7_TCM_ECC_IRQHandler,                          // 65 : M7 TCM ECC interrupt
    CM7_TCM_ERROR_IRQHandler,                        // 66 : M7 TCM Error interrupt
    Reserved67_IRQHandler,                          // 67 : Reserved interrupt
    Reserved68_IRQHandler,                          // 68 : Reserved interrupt
    FLEXIO1_IRQHandler,                          // 69 : FLEXIO1 interrupt
    FLEXIO2_IRQHandler,                          // 70 : FLEXIO2 interrupt
    FLEXSPI1_IRQHandler,                          // 71 : FLEXSPI1 interrupt
    FLEXSPI2_IRQHandler,                          // 72 : FLEXSPI2 interrupt
    GPIO2_0_IRQHandler,                          // 73 : GPIO2 interrupt 0
    GPIO2_1_IRQHandler,                          // 74 : GPIO2 interrupt 1
    GPIO3_0_IRQHandler,                          // 75 : GPIO3 interrupt 0
    GPIO3_1_IRQHandler,                          // 76 : GPIO3 interrupt 1
    I3C2_IRQHandler,                          // 77 : I3C2 interrupt
    LPI2C3_IRQHandler,                          // 78 : LPI2C3 interrupt
    Reserved79_IRQHandler,                          // 79 : Reserved interrupt
    LPIT2_IRQHandler,                          // 80 : LPIT2 interrupt
    LPSPI3_IRQHandler,                          // 81 : LPSPI3 interrupt
    LPSPI4_IRQHandler,                          // 82 : LPSPI4 interrupt
    LPTMR2_IRQHandler,                          // 83 : LPTMR2 interrupt
    LPUART3_IRQHandler,                          // 84 : LPUART3 interrupt
    LPUART4_IRQHandler,                          // 85 : LPUART4 interrupt
    LPUART5_IRQHandler,                          // 86 : LPUART5 interrupt
    LPUART6_IRQHandler,                          // 87 : LPUART6 interrupt
    Reserved88_IRQHandler,                          // 88 : Reserved interrupt
    BBNSM_IRQHandler,                          // 89 : BBNSM iterrupt
    SYS_CTR1_IRQHandler,                          // 90 : System Counter compare interrupt 0 and 1
    TPM3_IRQHandler,                          // 91 : TPM3 interrupt
    TPM4_IRQHandler,                          // 92 : TPM4 interrupt
    Reserved93_IRQHandler,                          // 93 : Reserved interrupt
    Reserved94_IRQHandler,                          // 94 : Reserved interrupt
    RTWDOG3_IRQHandler,                          // 95 : RTWDOG3 interrupt
    RTWDOG4_IRQHandler,                          // 96 : RTWDOG4 interrupt
    RTWDOG5_IRQHandler,                          // 97 : RTWDOG5 interrupt
    TRDC_MGR_WKUP_IRQHandler,                        // 98 : WAKEUPMIX TRDC transfer error interrupt
    TMPSNS_INT_IRQHandler,                          // 99 : Temperature alarm interrupt
    BBSM_IRQHandler,                          // 100: BBSM wakeup alarm interrupt
    LDO_AON_ANA_IRQHandler,                          // 101: Brown out interrupt
    Reserved102_IRQHandler,                          // 102: Reserved interrupt
    USDHC2_IRQHandler,                          // 103: USDHC2
    TRDC_MGR_MEGA_IRQHandler,                        // 104: MEGAMIX TRDC transfer error interrupt
    SFA_IRQHandler,                          // 105: Signal Frequency Analyzer interrupt
    LDO_AON_DIG_IRQHandler,                          // 106: Brown out interrupt
    MECC1_IRQHandler,                          // 107: MECC1 interrupt
    MECC2_IRQHandler,                          // 108: MECC2 interrupt
    ADC1_IRQHandler,                          // 109: ADC1 interrupt
    DMA_ERROR_IRQHandler,                          // 110: AON Domain eDMA error interrupt
    DMA3_CH0_IRQHandler,                          // 111: AON Domain eDMA channel 0 interrupt
    DMA3_CH1_IRQHandler,                          // 112: AON Domain eDMA channel 1 interrupt
    DMA3_CH2_IRQHandler,                          // 113: AON Domain eDMA channel 2 interrupt
    DMA3_CH3_IRQHandler,                          // 114: AON Domain eDMA channel 3 interrupt
    DMA3_CH4_IRQHandler,                          // 115: AON Domain eDMA channel 4 interrupt
    DMA3_CH5_IRQHandler,                          // 116: AON Domain eDMA channel 5 interrupt
    DMA3_CH6_IRQHandler,                          // 117: AON Domain eDMA channel 6 interrupt
    DMA3_CH7_IRQHandler,                          // 118: AON Domain eDMA channel 7 interrupt
    DMA3_CH8_IRQHandler,                          // 119: AON Domain eDMA channel 8 interrupt
    DMA3_CH9_IRQHandler,                          // 120: AON Domain eDMA channel 9 interrupt
    DMA3_CH10_IRQHandler,                          // 121: AON Domain eDMA channel 10 interrupt
    DMA3_CH11_IRQHandler,                          // 122: AON Domain eDMA channel 11 interrupt
    DMA3_CH12_IRQHandler,                          // 123: AON Domain eDMA channel 12 interrupt
    DMA3_CH13_IRQHandler,                          // 124: AON Domain eDMA channel 13 interrupt
    DMA3_CH14_IRQHandler,                          // 125: AON Domain eDMA channel 14 interrupt
    DMA3_CH15_IRQHandler,                          // 126: AON Domain eDMA channel 15 interrupt
    DMA3_CH16_IRQHandler,                          // 127: AON Domain eDMA channel 16 interrupt
    DMA3_CH17_IRQHandler,                          // 128: AON Domain eDMA channel 17 interrupt
    DMA3_CH18_IRQHandler,                          // 129: AON Domain eDMA channel 18 interrupt
    DMA3_CH19_IRQHandler,                          // 130: AON Domain eDMA channel 19 interrupt
    DMA3_CH20_IRQHandler,                          // 131: AON Domain eDMA channel 20 interrupt
    DMA3_CH21_IRQHandler,                          // 132: AON Domain eDMA channel 21 interrupt
    DMA3_CH22_IRQHandler,                          // 133: AON Domain eDMA channel 22 interrupt
    DMA3_CH23_IRQHandler,                          // 134: AON Domain eDMA channel 23 interrupt
    DMA3_CH24_IRQHandler,                          // 135: AON Domain eDMA channel 24 interrupt
    DMA3_CH25_IRQHandler,                          // 136: AON Domain eDMA channel 25 interrupt
    DMA3_CH26_IRQHandler,                          // 137: AON Domain eDMA channel 26 interrupt
    DMA3_CH27_IRQHandler,                          // 138: AON Domain eDMA channel 27 interrupt
    DMA3_CH28_IRQHandler,                          // 139: AON Domain eDMA channel 28 interrupt
    DMA3_CH29_IRQHandler,                          // 140: AON Domain eDMA channel 29 interrupt
    DMA3_CH30_IRQHandler,                          // 141: AON Domain eDMA channel 30 interrupt
    DMA3_CH31_IRQHandler,                          // 142: AON Domain eDMA channel 31 interrupt
    DMA4_ERROR_IRQHandler,                          // 143: WAKEUP Domain eDMA error interrupt
    DMA4_CH0_CH1_CH32_CH33_IRQHandler,               // 144: WAKEUP Domain eDMA channel 0/1/32/33 interrupt
    DMA4_CH2_CH3_CH34_CH35_IRQHandler,               // 145: WAKEUP Domain eDMA channel 2/3/34/35 interrupt
    DMA4_CH4_CH5_CH36_CH37_IRQHandler,               // 146: WAKEUP Domain eDMA channel 4/5/36/37 interrupt
    DMA4_CH6_CH7_CH38_CH39_IRQHandler,               // 147: WAKEUP Domain eDMA channel 6/7/38/39 interrupt
    DMA4_CH8_CH9_CH40_CH41_IRQHandler,               // 148: WAKEUP Domain eDMA channel 8/9/40/41 interrupt
    DMA4_CH10_CH11_CH42_CH43_IRQHandler,             // 149: WAKEUP Domain eDMA channel 10/11/42/43 interrupt
    DMA4_CH12_CH13_CH44_CH45_IRQHandler,             // 150: WAKEUP Domain eDMA channel 12/13/44/45 interrupt
    DMA4_CH14_CH15_CH46_CH47_IRQHandler,             // 151: WAKEUP Domain eDMA channel 14/15/46/47 interrupt
    DMA4_CH16_CH17_CH48_CH49_IRQHandler,             // 152: WAKEUP Domain eDMA channel 16/17/48/49 interrupt
    DMA4_CH18_CH19_CH50_CH51_IRQHandler,             // 153: WAKEUP Domain eDMA channel 18/19/50/51 interrupt
    DMA4_CH20_CH21_CH52_CH53_IRQHandler,             // 154: WAKEUP Domain eDMA channel 20/21/52/53 interrupt
    DMA4_CH22_CH23_CH54_CH55_IRQHandler,             // 155: WAKEUP Domain eDMA channel 22/23/54/55 interrupt
    DMA4_CH24_CH25_CH56_CH57_IRQHandler,             // 156: WAKEUP Domain eDMA channel 24/25/56/57 interrupt
    DMA4_CH26_CH27_CH58_CH59_IRQHandler,             // 157: WAKEUP Domain eDMA channel 26/27/58/59 interrupt
    DMA4_CH28_CH29_CH60_CH61_IRQHandler,             // 158: WAKEUP Domain eDMA channel 28/29/60/61 interrupt
    DMA4_CH30_CH31_CH62_CH63_IRQHandler,             // 159: WAKEUP Domain eDMA channel 30/31/62/63 interrupt
    XBAR1_CH0_CH1_IRQHandler,                        // 160: XBAR1 channel 0/1 interrupt
    XBAR1_CH2_CH3_IRQHandler,                        // 161: XBAR1 channel 2/3 interrupt
    SINC3_CH0_CH1_CH2_CH3_IRQHandler,                // 162: SINC Filter Glue 3 channel 0/1/2/3
    EWM_IRQHandler,                          // 163: EWM reset out interrupt
    SEMC_IRQHandler,                          // 164: SEMC interrupt
    LPIT3_IRQHandler,                          // 165: LPIT3 interrupt
    LPTMR3_IRQHandler,                          // 166: LPTMR3 interrupt
    TMR4_IRQHandler,                          // 167: TMR4 interrupt
    Reserved168_IRQHandler,                          // 168: Reserved interrupt
    LPI2C6_IRQHandler,                          // 169: LPI2C6 interrupt
    SAI4_IRQHandler,                          // 170: SAI4 interrupt
    SPDIF_IRQHandler,                          // 171: SPDIF interrupt
    Reserved172_IRQHandler,                          // 172: Reserved interrupt
    Reserved173_IRQHandler,                          // 173: Reserved interrupt
    Reserved174_IRQHandler,                          // 174: Reserved interrupt
    Reserved175_IRQHandler,                          // 175: Reserved interrupt
    INTG_BOOTROM_DEBUG_CTRL_IRQHandler,              // 176: CM33, CM7, DAP access IRQ
    EDGELOCK_REQ1_IRQHandler,                        // 177: Edgelock reuqest 1 interrupt
    EDGELOCK_REQ2_IRQHandler,                        // 178: Edgelock reuqest 2 interrupt
    EDGELOCK_REQ3_IRQHandler,                        // 179: Edgelock reuqest 3 interrupt
    TMR3_IRQHandler,                          // 180: TMR3 interrupt
    JTAGC_IRQHandler,                          // 181: JTAGC SRC reset source
    M33_SYSRESET_REQ_IRQHandler,                     // 182: CM33 SYSREQRST SRC reset source
    M33_LOCKUP_IRQHandler,                          // 183: CM33 LOCKUP SRC reset source
    M7_SYSRESET_REQ_IRQHandler,                      // 184: CM33 SYSREQRST SRC reset source
    M7_LOCKUP_IRQHandler,                          // 185: CM33 LOCKUP SRC reset source
    PWM2_FAULT_IRQHandler,                          // 186: PWM2 fault or reload error interrupt
    PWM2_0_IRQHandler,                          // 187: PWM2 capture 0, compare 0, or reload 0 interrupt
    PWM2_1_IRQHandler,                          // 188: PWM2 capture 1, compare 1, or reload 1 interrupt
    PWM2_2_IRQHandler,                          // 189: PWM2 capture 2, compare 2, or reload 2 interrupt
    PWM2_3_IRQHandler,                          // 190: PWM2 capture 3, compare 3, or reload 3 interrupt
    PWM3_FAULT_IRQHandler,                          // 191: PWM3 fault or reload error interrupt
    PWM3_0_IRQHandler,                          // 192: PWM3 capture 0, compare 0, or reload 0 interrupt
    PWM3_1_IRQHandler,                          // 193: PWM3 capture 1, compare 1, or reload 1 interrupt
    PWM3_2_IRQHandler,                          // 194: PWM3 capture 2, compare 2, or reload 2 interrupt
    PWM3_3_IRQHandler,                          // 195: PWM3 capture 3, compare 3, or reload 3 interrupt
    PWM4_FAULT_IRQHandler,                          // 196: PWM4 fault or reload error interrupt
    PWM4_0_IRQHandler,                          // 197: PWM4 capture 0, compare 0, or reload 0 interrupt
    PWM4_1_IRQHandler,                          // 198: PWM4 capture 1, compare 1, or reload 1 interrupt
    PWM4_2_IRQHandler,                          // 199: PWM4 capture 2, compare 2, or reload 2 interrupt
    PWM4_3_IRQHandler,                          // 200: PWM4 capture 3, compare 3, or reload 3 interrupt
    EQDC1_IRQHandler,                          // 201: EQDC1 interrupt
    EQDC2_IRQHandler,                          // 202: EQDC2 interrupt
    EQDC3_IRQHandler,                          // 203: EQDC3 interrupt
    EQDC4_IRQHandler,                          // 204: EQDC4 interrupt
    ADC2_IRQHandler,                          // 205: ADC2 interrupt
    DCDC_IRQHandler,                          // 206: DCDC brown out interrupt
    CAN3_IRQHandler,                          // 207: CAN3 interrupt
    CAN3_ERROR_IRQHandler,                          // 208: CAN3 error interrupt
    DAC_IRQHandler,                          // 209: DAC interrupt
    LPSPI5_IRQHandler,                          // 210: LPSPI5 interrupt
    LPSPI6_IRQHandler,                          // 211: LPSPI6 interrupt
    LPUART7_IRQHandler,                          // 212: LPUART7 interrupt
    LPUART8_IRQHandler,                          // 213: LPUART8 interrupt
    SAI2_IRQHandler,                          // 214: SAI2 interrupt
    Reserved215_IRQHandler,                          // 215: Reserved interrupt
    Reserved216_IRQHandler,                          // 216: Reserved interrupt
    Reserved217_IRQHandler,                          // 217: Reserved interrupt
    ACMP3_IRQHandler,                          // 218: CMP3 interrupt
    Reserved219_IRQHandler,                          // 219: Reserved interrupt
    CM7_PS_IRQHandler,                          // 220: M7 PS Tag/Data Parity Error
    CM7_MCM_IRQHandler,                          // 221: M7 MCM interrupt
    CM33_MCM_IRQHandler,                          // 222: M33 MCM interrupt
    ECAT_INT_IRQHandler,                          // 223: EtherCAT interrupt
    SAFETY_CLK_MON_IRQHandler,                       // 224: Safety clock monitor interrupt
    GPT1_IRQHandler,                          // 225: GPT1 interrupt
    GPT2_IRQHandler,                          // 226: GPT2 interrupt
    KPP_IRQHandler,                          // 227: KPP interrupt
    USBPHY1_IRQHandler,                          // 228: USBPHY1 interrupt
    Reserved229_IRQHandler,                          // 229: Reserved interrupt
    Reserved230_IRQHandler,                          // 230: Reserved interrupt
    USB_OTG1_IRQHandler,                          // 231: USBOTG1 interrupt
    FLEXSPI_SLV_IRQHandler,                          // 232: FLEXSPI follower interrupt
    NETC_IRQHandler,                          // 233: NETC interrupt
    MSGINTR1_IRQHandler,                          // 234: MSGINTR1 interrupt
    MSGINTR2_IRQHandler,                          // 235: MSGINTR2 interrupt
    MSGINTR3_IRQHandler,                          // 236: MSGINTR3 interrupt
    MSGINTR4_IRQHandler,                          // 237: MSGINTR4 interrupt
    MSGINTR5_IRQHandler,                          // 238: MSGINTR5 interrupt
    MSGINTR6_IRQHandler,                          // 239: MSGINTR6 interrupt
    SINC1_CH0_IRQHandler,                          // 240: SINC Filter Glue 1 channel 0
    SINC1_CH1_IRQHandler,                          // 241: SINC Filter Glue 1 channel 1
    SINC1_CH2_IRQHandler,                          // 242: SINC Filter Glue 1 channel 2
    SINC1_CH3_IRQHandler,                          // 243: SINC Filter Glue 1 channel 3
    SINC2_CH0_IRQHandler,                          // 244: SINC Filter Glue 2 channel 0
    SINC2_CH1_IRQHandler,                          // 245: SINC Filter Glue 2 channel 1
    SINC2_CH2_IRQHandler,                          // 246: SINC Filter Glue 2 channel 2
    SINC2_CH3_IRQHandler,                          // 247: SINC Filter Glue 2 channel 3
    GPIO4_IRQHandler,                          // 248: GPIO4 interrupt
    TMR2_IRQHandler,                          // 249: TMR2 interrupt
    GPIO5_IRQHandler,                          // 250: GPIO5 interrupt
    ASRC_IRQHandler,                          // 251: ASRC interrupt
    GPIO6_IRQHandler,                          // 252: GPIO6 interrupt
    DBG_TRACE_IRQHandler,                          // 253: JTAGSW DAP MDM-AP SRC reset source
    ECAT_RST_OUT_IRQHandler,                         // 254: ECAT reset out interrupt
}; /* End of g_pfnVectors */

//*****************************************************************************
// Functions to carry out the initialization of RW and BSS data sections. These
// are written as separate functions rather than being inlined within the
// ResetISR() function in order to cope with MCUs with multiple banks of
// memory.
//*****************************************************************************
__attribute__ ((section(".after_vectors.init_data")))
void data_init(unsigned int romstart, unsigned int start, unsigned int len) {
    unsigned int *pulDest = (unsigned int*) start;
    unsigned int *pulSrc = (unsigned int*) romstart;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = *pulSrc++;
}

__attribute__ ((section(".after_vectors.init_bss")))
void bss_init(unsigned int start, unsigned int len) {
    unsigned int *pulDest = (unsigned int*) start;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = 0;
}

//*****************************************************************************
// The following symbols are constructs generated by the linker, indicating
// the location of various points in the "Global Section Table". This table is
// created by the linker via the Code Red managed linker script mechanism. It
// contains the load address, execution address and length of each RW data
// section and the execution and length of each BSS (zero initialized) section.
//*****************************************************************************
extern unsigned int __data_section_table;
extern unsigned int __data_section_table_end;
extern unsigned int __bss_section_table;
extern unsigned int __bss_section_table_end;

//*****************************************************************************
// Reset entry point for your code.
// Sets up a simple runtime environment and initializes the C/C++
// library.
//*****************************************************************************
__attribute__ ((naked, section(".after_vectors.reset")))
void ResetISR(void) {
    // Disable interrupts
    __asm volatile ("cpsid i");
    __asm volatile ("MSR MSP, %0" : : "r" (&_vStackTop) : );

