Masmiseim36/nxpSDK/devices/MIMXRT1186/mcuxpresso/startup_mimxrt1186_cm7.c
WEAK void EDGELOCK_SECURE_IRQHandler(void)
{   EDGELOCK_SECURE_DriverIRQHandler();
}

WEAK void EDGELOCK_NONSECURE_IRQHandler(void)
{   EDGELOCK_NONSECURE_DriverIRQHandler();
}

WEAK void TPM1_IRQHandler(void)
{   TPM1_DriverIRQHandler();
}

WEAK void TPM2_IRQHandler(void)
{   TPM2_DriverIRQHandler();
}

WEAK void RTWDOG1_IRQHandler(void)
{   RTWDOG1_DriverIRQHandler();
}

WEAK void RTWDOG2_IRQHandler(void)
{   RTWDOG2_DriverIRQHandler();
}

WEAK void TRDC_MGR_AON_IRQHandler(void)
{   TRDC_MGR_AON_DriverIRQHandler();
}

WEAK void PDM_HWVAD_EVENT_IRQHandler(void)
{   PDM_HWVAD_EVENT_DriverIRQHandler();
}

WEAK void PDM_HWVAD_ERROR_IRQHandler(void)
{   PDM_HWVAD_ERROR_DriverIRQHandler();
}

WEAK void PDM_EVENT_IRQHandler(void)
{   PDM_EVENT_DriverIRQHandler();
}

WEAK void PDM_ERROR_IRQHandler(void)
{   PDM_ERROR_DriverIRQHandler();
}

WEAK void SAI1_IRQHandler(void)
{   SAI1_DriverIRQHandler();
}

WEAK void CM33_PS_IRQHandler(void)
{   CM33_PS_DriverIRQHandler();
}

WEAK void CM33_TCM_ECC_IRQHandler(void)
{   CM33_TCM_ECC_DriverIRQHandler();
}

WEAK void CM33_TCM_ERROR_IRQHandler(void)
{   CM33_TCM_ERROR_DriverIRQHandler();
}

WEAK void CM7_TCM_ECC_IRQHandler(void)
{   CM7_TCM_ECC_DriverIRQHandler();
}

WEAK void CM7_TCM_ERROR_IRQHandler(void)
{   CM7_TCM_ERROR_DriverIRQHandler();
}

WEAK void Reserved67_IRQHandler(void)
{   Reserved67_DriverIRQHandler();
}

WEAK void Reserved68_IRQHandler(void)
{   Reserved68_DriverIRQHandler();
}

WEAK void FLEXIO1_IRQHandler(void)
{   FLEXIO1_DriverIRQHandler();
}

WEAK void FLEXIO2_IRQHandler(void)
{   FLEXIO2_DriverIRQHandler();
}

WEAK void FLEXSPI1_IRQHandler(void)
{   FLEXSPI1_DriverIRQHandler();
}

WEAK void FLEXSPI2_IRQHandler(void)
{   FLEXSPI2_DriverIRQHandler();
}

WEAK void GPIO2_0_IRQHandler(void)
{   GPIO2_0_DriverIRQHandler();
}

WEAK void GPIO2_1_IRQHandler(void)
{   GPIO2_1_DriverIRQHandler();
}

WEAK void GPIO3_0_IRQHandler(void)
{   GPIO3_0_DriverIRQHandler();
}

WEAK void GPIO3_1_IRQHandler(void)
{   GPIO3_1_DriverIRQHandler();
}

WEAK void I3C2_IRQHandler(void)
{   I3C2_DriverIRQHandler();
}

WEAK void LPI2C3_IRQHandler(void)
{   LPI2C3_DriverIRQHandler();
}

WEAK void Reserved79_IRQHandler(void)
{   Reserved79_DriverIRQHandler();
}

WEAK void LPIT2_IRQHandler(void)
{   LPIT2_DriverIRQHandler();
}

WEAK void LPSPI3_IRQHandler(void)
{   LPSPI3_DriverIRQHandler();
}

WEAK void LPSPI4_IRQHandler(void)
{   LPSPI4_DriverIRQHandler();
}

WEAK void LPTMR2_IRQHandler(void)
{   LPTMR2_DriverIRQHandler();
}

WEAK void LPUART3_IRQHandler(void)
{   LPUART3_DriverIRQHandler();
}

WEAK void LPUART4_IRQHandler(void)
{   LPUART4_DriverIRQHandler();
}

WEAK void LPUART5_IRQHandler(void)
{   LPUART5_DriverIRQHandler();
}

WEAK void LPUART6_IRQHandler(void)
{   LPUART6_DriverIRQHandler();
}

WEAK void Reserved88_IRQHandler(void)
{   Reserved88_DriverIRQHandler();
}

WEAK void BBNSM_IRQHandler(void)
{   BBNSM_DriverIRQHandler();
}

WEAK void SYS_CTR1_IRQHandler(void)
{   SYS_CTR1_DriverIRQHandler();
}

WEAK void TPM3_IRQHandler(void)
{   TPM3_DriverIRQHandler();
}

WEAK void TPM4_IRQHandler(void)
{   TPM4_DriverIRQHandler();
}

WEAK void Reserved93_IRQHandler(void)
{   Reserved93_DriverIRQHandler();
}

WEAK void Reserved94_IRQHandler(void)
{   Reserved94_DriverIRQHandler();
}

WEAK void RTWDOG3_IRQHandler(void)
{   RTWDOG3_DriverIRQHandler();
}

WEAK void RTWDOG4_IRQHandler(void)
{   RTWDOG4_DriverIRQHandler();
}

WEAK void RTWDOG5_IRQHandler(void)
{   RTWDOG5_DriverIRQHandler();
}

WEAK void TRDC_MGR_WKUP_IRQHandler(void)
{   TRDC_MGR_WKUP_DriverIRQHandler();
}

WEAK void TMPSNS_INT_IRQHandler(void)
{   TMPSNS_INT_DriverIRQHandler();
}

WEAK void BBSM_IRQHandler(void)
{   BBSM_DriverIRQHandler();
}

WEAK void LDO_AON_ANA_IRQHandler(void)
{   LDO_AON_ANA_DriverIRQHandler();
}

WEAK void Reserved102_IRQHandler(void)
{   Reserved102_DriverIRQHandler();
}

WEAK void USDHC2_IRQHandler(void)
{   USDHC2_DriverIRQHandler();
}

WEAK void TRDC_MGR_MEGA_IRQHandler(void)
{   TRDC_MGR_MEGA_DriverIRQHandler();
}

WEAK void SFA_IRQHandler(void)
{   SFA_DriverIRQHandler();
}

WEAK void LDO_AON_DIG_IRQHandler(void)
{   LDO_AON_DIG_DriverIRQHandler();
}

WEAK void MECC1_IRQHandler(void)
{   MECC1_DriverIRQHandler();
}

WEAK void MECC2_IRQHandler(void)
{   MECC2_DriverIRQHandler();
}

WEAK void ADC1_IRQHandler(void)
{   ADC1_DriverIRQHandler();
}

WEAK void DMA_ERROR_IRQHandler(void)
{   DMA_ERROR_DriverIRQHandler();
}

WEAK void DMA3_CH0_IRQHandler(void)
{   DMA3_CH0_DriverIRQHandler();
}

WEAK void DMA3_CH1_IRQHandler(void)
{   DMA3_CH1_DriverIRQHandler();
}

WEAK void DMA3_CH2_IRQHandler(void)
{   DMA3_CH2_DriverIRQHandler();
}

WEAK void DMA3_CH3_IRQHandler(void)
{   DMA3_CH3_DriverIRQHandler();
}

WEAK void DMA3_CH4_IRQHandler(void)
{   DMA3_CH4_DriverIRQHandler();
}

WEAK void DMA3_CH5_IRQHandler(void)
{   DMA3_CH5_DriverIRQHandler();
}

WEAK void DMA3_CH6_IRQHandler(void)
{   DMA3_CH6_DriverIRQHandler();
}

WEAK void DMA3_CH7_IRQHandler(void)
{   DMA3_CH7_DriverIRQHandler();
}

WEAK void DMA3_CH8_IRQHandler(void)
{   DMA3_CH8_DriverIRQHandler();
}

WEAK void DMA3_CH9_IRQHandler(void)
{   DMA3_CH9_DriverIRQHandler();
}

WEAK void DMA3_CH10_IRQHandler(void)
{   DMA3_CH10_DriverIRQHandler();
}

WEAK void DMA3_CH11_IRQHandler(void)
{   DMA3_CH11_DriverIRQHandler();
}

WEAK void DMA3_CH12_IRQHandler(void)
{   DMA3_CH12_DriverIRQHandler();
}

WEAK void DMA3_CH13_IRQHandler(void)
{   DMA3_CH13_DriverIRQHandler();
}

WEAK void DMA3_CH14_IRQHandler(void)
{   DMA3_CH14_DriverIRQHandler();
}

WEAK void DMA3_CH15_IRQHandler(void)
{   DMA3_CH15_DriverIRQHandler();
}

WEAK void DMA3_CH16_IRQHandler(void)
{   DMA3_CH16_DriverIRQHandler();
}

WEAK void DMA3_CH17_IRQHandler(void)
{   DMA3_CH17_DriverIRQHandler();
}

WEAK void DMA3_CH18_IRQHandler(void)
{   DMA3_CH18_DriverIRQHandler();
}

WEAK void DMA3_CH19_IRQHandler(void)
{   DMA3_CH19_DriverIRQHandler();
}

WEAK void DMA3_CH20_IRQHandler(void)
{   DMA3_CH20_DriverIRQHandler();
}

WEAK void DMA3_CH21_IRQHandler(void)
{   DMA3_CH21_DriverIRQHandler();
}

WEAK void DMA3_CH22_IRQHandler(void)
{   DMA3_CH22_DriverIRQHandler();
}

WEAK void DMA3_CH23_IRQHandler(void)
{   DMA3_CH23_DriverIRQHandler();
}

WEAK void DMA3_CH24_IRQHandler(void)
{   DMA3_CH24_DriverIRQHandler();
}

WEAK void DMA3_CH25_IRQHandler(void)
{   DMA3_CH25_DriverIRQHandler();
}

